1. Create a data frame with 4 columns 4 rows

In [117]:
import pandas as pd
k=([[3,4,5,6],[1,6,8,3],[1,7,9,3],[6,8,3,0]])
g=pd.DataFrame(k,index=["s","a","i","p"],columns=["a","b","c","d"])
print(g)

   a  b  c  d
s  3  4  5  6
a  1  6  8  3
i  1  7  9  3
p  6  8  3  0

2. print all Columns form your data frame

In [118]:
g.columns

Index(['a', 'b', 'c', 'd'], dtype='object')

3. print all rows from your data frame

In [119]:
g.loc[:]

   a  b  c  d
s  3  4  5  6
a  1  6  8  3
i  1  7  9  3
p  6  8  3  0

4. print Second column in your data frame

In [120]:
g[["b"]]

   b
s  4
a  6
i  7
p  8

5. print last 2 columns from your data Frame

In [121]:
g.loc[:,"c":]

   c  d
s  5  6
a  8  3
i  9  3
p  3  0

6. print fourth row from your data Frame

In [122]:
g.loc[["p"]]

   a  b  c  d
p  6  8  3  0

7. print first 2 Rows from your data Frame

In [123]:
g.loc[:"a"]

   a  b  c  d
s  3  4  5  6
a  1  6  8  3

8. print all rows and first 2 columns from your data Frame

In [124]:
g.loc[:,:"b"]

   a  b
s  3  4
a  1  6
i  1  7
p  6  8

9. Delete any row from your data Frame

In [125]:
g.drop("a")

   a  b  c  d
s  3  4  5  6
i  1  7  9  3
p  6  8  3  0

10. Delete any column from your data Frame

In [126]:
g.pop("c")

s    5
a    8
i    9
p    3
Name: c, dtype: int64

11. Add a column to a Data Frame

In [127]:
new=[1,4,3,6]
g["m"]=new
print(pd.DataFrame(g))

   a  b  d  m
s  3  4  6  1
a  1  6  3  4
i  1  7  3  3
p  6  8  0  6

12. Add a Row to Data Frame

In [128]:
new={'a':1,'b':2,'d':0,'m':9}
k=pd.DataFrame(new,index=["i"])
g=pd.concat([k,g])
print(g)

   a  b  d  m
i  1  2  0  9
s  3  4  6  1
a  1  6  3  4
i  1  7  3  3
p  6  8  0  6

13. Iterate all Columns in your Data Frame and print result

In [129]:
for i in g:
    print(i)

a
b
d
m

14. Iterate the 3rd column values of your Data frame and print result.

In [130]:
x=g.pop("m")
for i in x:
    print(i)

9
1
4
3
6

15. Iterate all Rows in your Data Frame and print result.

In [131]:
for i in g.iterrows():
    print(i)

('i', a    1
b    2
d    0
Name: i, dtype: int64)
('s', a    3
b    4
d    6
Name: s, dtype: int64)
('a', a    1
b    6
d    3
Name: a, dtype: int64)
('i', a    1
b    7
d    3
Name: i, dtype: int64)
('p', a    6
b    8
d    0
Name: p, dtype: int64)

16. Read income.csv file and print as Data Frame

In [132]:
s="income.csv"
d=pd.read_csv(s)
d

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

17. Get 2006 column info from your data Frame by using drop

In [133]:
d.drop(columns=["2006"],axis=1)

,GEOID,State,2005,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55734,57014,56134,54283,53367,57020,57528